Revit 2027 API
ExternalResourceLoadData.ExternalResourceType Property
 The ExternalResourceType for which Revit is requesting data from the server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceType ExternalResourceType { get; }
Public ReadOnly Property ExternalResourceType As ExternalResourceType
	Get
public:
property ExternalResourceType^ ExternalResourceType {
	ExternalResourceType^ get ();
}
member ExternalResourceType : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace